AirportManagement/app/controllers/passengers_controller.rb

  def index
    @passengers = Passenger.all
---
SELECT "passengers".* FROM "passengers"

  def create
    @passenger = Passenger.new(passenger_params)

    respond_to do |format|
      if @passenger.save
---
INSERT INTO "passengers" ("checkIn", "name", "aircraft", "destination", "gate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["checkIn", 1], ["name", "Jp"], ["aircraft", ""], ["destination", "London"], ["gate", "33C"], ["created_at", "2023-12-15 19:18:51.579749"], ["updated_at", "2023-12-15 19:18:51.579749"]]

  def update
    respond_to do |format|
      if @passenger.update(passenger_params)
---
UPDATE "passengers" SET "name" = ?, "aircraft" = ?, "destination" = ?, "gate" = ?, "updated_at" = ? WHERE "passengers"."id" = ?  [["name", "Joosh"], ["aircraft", "Ryanair"], ["destination", "London"], ["gate", "54A"], ["updated_at", "2023-12-15 16:10:53.955468"], ["id", 3]]

  def destroy
    @passenger.destroy!
---
DELETE FROM "passengers" WHERE "passengers"."id" = ?  [["id", 6]]

    def set_passenger
      @passenger = Passenger.find(params[:id])
---
SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]